20251128T092223--kdoc-490-301と302307のキャッシュ動作の違い__wiki.org
:properties:
:ID: 20251128T092223
:end:
#+title:      KDOC 490: 301と302/307のキャッシュ動作の違い
#+date:       [2025-11-28 Fri 09:22]
#+filetags:   :wiki:
#+identifier: 20251128T092223

* この文書のステータス
- 作成
  - [X] 2025-12-06 貴島
- レビュー
  - [X] 2025-12-15 貴島

* 概要

HTTPステータスコードの301と302/307は、どれもリダイレクトということで似ているのだが、ブラウザでキャッシュの扱いに違いがある。

301は恒久的リダイレクトで、キャッシュできる、とHTTPの仕様で言及されている。

#+begin_quote
A 301 response is heuristically cacheable; i.e., unless otherwise indicated by the method definition or explicit cache controls (see Section 4.2.2 of [CACHING]).
[[https://www.rfc-editor.org/rfc/rfc9110#status.301][RFC 9110: HTTP Semantics]]
#+end_quote

302/307は一時的リダイレクトなので、キャッシュについては言及していないように見える。じっさいの動作から考えて、毎回リダイレクト判断しているようである。

* 関連

- 追加調査: ブラウザの動作をじっさいに試す
