20251128T092223--kdoc-490-301と302307のキャッシュ動作の違い__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-12-17T23:09:32Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 490: 301と302/307のキャッシュ動作の違い</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 490: 301と302/307のキャッシュ動作の違い</h1>
<div id="outline-container-org97d5210" class="outline-2">
<h2 id="org97d5210"><a href="#org97d5210">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org97d5210">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-12-06 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-12-15 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org24be65f" class="outline-2">
<h2 id="org24be65f"><a href="#org24be65f">概要</a></h2>
<div class="outline-text-2" id="text-org24be65f">
<p>
HTTPステータスコードの301と302/307は、どれもリダイレクトということで似ているのだが、ブラウザでキャッシュの扱いに違いがある。
</p>

<p>
301は恒久的リダイレクトで、キャッシュできる、とHTTPの仕様で言及されている。
</p>

<blockquote>
<p>
A 301 response is heuristically cacheable; i.e., unless otherwise indicated by the method definition or explicit cache controls (see Section 4.2.2 of [CACHING]).
<a href="https://www.rfc-editor.org/rfc/rfc9110#status.301">RFC 9110: HTTP Semantics</a>
</p>
</blockquote>

<p>
302/307は一時的リダイレクトなので、キャッシュについては言及していないように見える。じっさいの動作から考えて、毎回リダイレクト判断しているようである。
</p>
</div>
</div>
<div id="outline-container-org4ea7046" class="outline-2">
<h2 id="org4ea7046"><a href="#org4ea7046">関連</a></h2>
<div class="outline-text-2" id="text-org4ea7046">
<ul class="org-ul">
<li>追加調査: ブラウザの動作をじっさいに試す</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
